Revit 2027 API
BasicFileInfo.IsSavedInCurrentVersion Property
 Checks if the file is saved in the current version.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSavedInCurrentVersion { get; }
Public ReadOnly Property IsSavedInCurrentVersion As Boolean
	Get
public:
property bool IsSavedInCurrentVersion {
	bool get ();
}
member IsSavedInCurrentVersion : bool with get
Property Value
Boolean
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace